Revit 2027 API
ViewSheetSetting.Rename Method
Rename the current view sheet set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Rename(
	string newName
)
Public Function Rename (
	newName As String
) As Boolean
public:
bool Rename(
	String^ newName
)
member Rename :
        newName : string -> bool
Parameters
newName String
View sheet set name to be renamed as.
Return Value
Boolean
False if Rename operation fails, otherwise True.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the input name is already existed in current view sheet set list.
See Also
Reference
ViewSheetSetting Class
Autodesk.Revit.DB Namespace